[
  {
    "authors": "",
    "content": "<p><em><span >\"If you are one of the lucky ones who have survived the darkness, just remember, never look back,\"</span></em></p><p><span >&hellip;is what many would say is an act of consolation and a push to keep going. This, however, does not fit the conversation of Philippine politics at all, where the haunting past has come back knocking on everyone's door once more. Said knock is one that should be ringing in everyone's ears as a truth that cannot and should not be ignored.</span></p><p><span >&nbsp;It is often circulated that today's youth are uninterested in political events and are too wrapped up in their self-interests to pay any mind to the business of politics. Yet, commonplace phrases like \"the youth are the future\" or \"the youth is the hope of our nation\" are looking to ring true, especially in today's Philippine society. Scrolling through social media will give you a sense of how young people have turned digital spaces into a microcosm of what the Philippines should and should not be. With the 2022 elections right around the corner, the youth vote &mdash; both an idea and advocacy &mdash; has become not just a trend but an absolute necessity again.&nbsp;</span></p><p><span >Anything that impedes the right to vote impedes democracy itself. Political participation is a constitutionally-recognized right, but some choose to be non-participative anyway. It is not enough to have the right (to vote); it is just as important to be responsible enough to make full use of it to prevent another reign of ruthless tyranny and senseless violence.</span></p><p><span >&nbsp;</span> <span >As political dynasties and oligarchs continue to prevail, the remedy might not only be legislative but cultural-structural. When the core of power is rent-seeking behavior and political patronage, prohibiting political dynasties will not lead to the oligarchy's demise. While dynasties enable oligarchy, it is deeply rooted in structural inequalities in wealth and power and the weaknesses of our political institutions, such as the political party system.</span></p><p><span >The real enemy here is the concentration of power. Political dynasties and oligarchy are just symptoms and structural manifestations of it. The concentration of power in the political and economic elites is possible because the people have renounced their role as sovereigns and their responsibility to participate in politics as empowered, rational, active, and well-informed citizens. The antidote to this should not stop at enacting a law prohibiting political dynasties. The solution is political literacy and education, which will enable people to become active citizens and reclaim their sovereign power at all levels.</span></p><p><span >It is a fact of life that we live in a political landscape marked by extreme inequality. Some would argue that the strength of its institutions determines a good democratic government. Although partially true, the essence of democracy is actually the citizens. The quality of government lies on the quality of the governed&mdash;those governed must be politically literate enough to understand the significance of living in a democracy. Citizens, especially the youth, will have to learn the virtue of criticism and the value of dissent.</span></p><p><span >Young people are the future that will support all the generations before them. However, power is constantly being withheld from the youth, limiting and binding any form of political movement. Interpreting low voter turnout as evidence of apathy ignores the structural, organizational, and familial obstacles many young people face. Of course, you could turn your back on all things political in the hopes somebody else will stand up for your opinion. Yet, the moment young people turn their back on politics is the exact moment citizens lose power over their lives.&nbsp;</span></p><p><span >Politics is giving the people in power all the capacities they need to take over lives and transform them into whatever they wish. The youth do not just benefit; they are part of the conversation. The moment people stop caring is the moment they give up control. The youth should care about politics because they concern them more than anyone. Young people have the world in their hands&ndash;take your eyes off politics, and you&rsquo;re gone. Just like that.</span></p><p><span >At least 67.5 million Filipinos will be eligible to cast their ballots in the coming elections, a number which the Commission on Elections (COMELEC) stated is proof that Filipinos are eager to vote even with the threat of an ongoing pandemic. With 32.7 million between the ages of 18 and 30, at least 5.4 million are voting for the first time. Beyond registered voters, these figures show that the youth have the right, the skills, and definitely the numbers to make a difference.&nbsp;</span></p><p><span >The old mantra to \"never discuss religion or politics\" was a recognition that political differences can create awkward social situations. Thus, many avoid the conversation just to preserve the bonds and close ties that are on the line when politics are at stake. People fail to realize that you are precisely who you vote for; to give your support to any political candidate or institution, whether out of affinity, blood, or loyalty, is between you and your conscience&mdash;it's a reflection of your beliefs that forms you. Being politically literate is more than just knowing the institutions and the people behind them. It's a call for values, and the earlier you accept and grasp that fact, the earlier you embody political literacy.</span></p><p><span >Being politically literate means knowing that it is not and never will be enough to have heard your parent's viewpoints on something and adopt them as your own. That it's not just about dropping opinions but having formed informed judgment to go with it as well. That it is not enough to go through your social media timelines and read only the shared posts of people that have grown up in similar ideals and places as you. While social media has its advantages, it makes it more difficult to have an in-depth, respectful discussion of issues often due to anonymity. The character limits of a tweet or post may prevent users from conveying the full complexity of their views&mdash;an easy invite to misinterpretation. There are scholarly works worth reading besides the TikTok videos and Facebook posts, too, you know.</span></p><p><span >Being politically literate means knowing people in power aren't usually that clear-headed; they don't make a substantial distinction between what's politically convenient to say and what they really believe. It's pretty clear that much of what a number of politicians say is in self-conscious lousy faith; they say what is politically convenient, brush aside facts that don't fit their agendas, and make claims they have to know are false.</span></p><p><span >Political literacy is the only way to diminish the power of oligarchs and render dynasties irrelevant. It is the only way to prevent the past from coming back and continue a regime of grand corruption and abuses. The only way to prevent this concentration of power in a few is for us, the many, to take it back&mdash;the only way to live in a better Philippine era.</span></p><p><span >The general divide in politics is often depicted as purely cultural&mdash;as if one's politics were solely mediated by aesthetics, such as whether one prefers shooting guns or drinking wine. This is a great detriment to civil discourse. Seeing politics as an aesthetic transforms what should be a quantitative debate&mdash;with statistics and numbers about taxation and public policy and questions about who benefits more or less from policy changes&mdash;into a rhetorical debate about values. Paul Krugman, an economist, professor, and New York Times columnist, once wrote that the malign influence of these people is \"propping up zombie ideas &mdash; ideas that should have been killed by contrary evidence, but instead keep shambling along, eating people's brains.\"</span></p><p><span >In a country where zombies are lurking in politics and among the masses, it's all about defending your life, as well as protecting those around you even if they remain strangers&mdash;no matter how far you are in life, we will all go alive from here.</span></p>",
    "id": 1,
    "title": "If You Vote Wrong, ALL OF US ARE DEAD",
    "url": "https://cdn.discordapp.com/attachments/897553246787342406/953683700678279198/unknown.png"
  },
  {
    "authors": "Dennis Clyde B. Castilla",
    "content": "<p><span >Morelos Campus of Father Saturnino Urios University celebrated the institution&rsquo;s 120th foundation day featuring a new sports competition. E-sports, used as a substitute to the annual intramural sports, highlighting the online games Valorant and Call of Duty Mobile (CODM), streamed last September 22-24, 2021, on the FSUU Morelos Facebook page.&nbsp;</span></p><p><span >Both games are considered FPS (First-person shooter) and are classified as online action shooting games constituting a maximum of five players per team. With CODM to be played on a cell phone or tablet device and Valorant on PC.&nbsp;</span></p><p><span >The Esports competition was opened to all high-school levels, with each level forming a squad representing their respective grade level for the two categories. As each team battled it out through each stage, representing their separate banners with pride, the players and the audience felt the intensity of the tournament.&nbsp;</span></p><p><span >In the Call of Duty arena, teams from each level competed in a best of three in the Search and Destroy and Hardpoint modes to advance a spot in the following rounds.&nbsp;</span></p><p><span >Team Bonakidz, representing the Grade 7 Green Pythons, stood firm as they finished third place, while Team Exodus Esports of the Grade 12 Galactic Wolves ended up in second place, as they succumbed to the indomitable Team Uwu of the Grade 8 Yellow Phoenix led by Jai Uchida in a best of five series championship match&mdash;leaving the sophomores to be the crowned champions of the CODM tournament.&nbsp;</span></p><p><span >The ambiance of the tournament changed once more as the squads of every grade level contended in the arena of one of the most exciting, competitive, and recent FPS games. Like the first game, Valorant was to be played in best of three sets in every bout of the competition, while a best of five series awaited the players in the championship round.&nbsp;</span></p><p><span >The seniors, Team ASMR Mukbang of the Grade 11 Greyhounds and the Eco Hub Grade 12 Galactic Wolves, took the limelight in the competition. They delivered an intense and thrilling series of skirmishes in the regular rounds. Led by Harold Rodriguez, Team ASMR Mukbang then bagged the championship title of the tournament, as they dispatched their opponent, acing the best of five series in a 3-1 standing.&nbsp;</span></p><p><span >The conducted online tournament was the alternative taken by FSUU in lieu of the school&rsquo;s yearly physical sports intramurals as the institution continues to adjust to the new normal. This might also serve as the stepping stone in embracing and recognizing Esports in future school activities.</span></p>",
    "id": 2,
    "title": "FSUU Morelos intramurals: E-sports On",
    "url": "https://cdn.discordapp.com/attachments/897553246787342406/953689095169777784/unknown.png"
  }
]
