[
  {
    "authors": "Ianne Gencianeo",
    "content": "<p><span >Father Saturnino Urios University celebrated its 120th foundation day anniversary through virtual or online platforms. Year emblems are back at it again as each gained the limelight and featured their talents in the FSUU page last September 23, 2021.</span></p><p><span >In this year&rsquo;s University Days, each emblem was given the opportunity to highlight their talents and represent their respective grade levels&mdash;an event that allowed the students to know their fellow Urians better.&nbsp;</span></p><p><span >The Grade 7 Green Python&rsquo;s Emmanuel Corvera shared his talent in art and making music, while Uaine Sarsaba, shared her groove and talent in dancing while mirroring how a snake slithers.</span></p><p><span >Grade 8 Yellow Phoenix's Jai Uchida, a young and aspiring athlete,&nbsp; showed his excellent skills in Taekwondo while giving an awe-inspiring rendition of his athletic kicks and forms in the Korean martial art.&nbsp; On the other hand, his partner April Tapon presented a time lapse of herself drawing a building with her pencil strokes.</span></p><p><span >Moreover, the third-year representative, Khadd Lansang danced in tune of the trending K-pop songs Butter and Dynamite while Aaliyah Orcollo represented the Red Raptors with her own song rendition.</span></p><p><span >Furthermore, Blue Eagle&rsquo;s Kennevic Elumbaring shared a recorded video of himself making a realistic drawing of an eagle while his emblem partner, Rafaela Andaya performed her dance number.</span></p><p><span >Meanwhile, Grade 11 Greyhounds&rsquo; Miguel Catubag played his way through the chords as he covered a song with his electric guitar while his counterpart, Janine Suazo, presented a dance.</span></p><p><span >Ishin Nonan of the Galactic Wolves featured his drumming skills while covering a song while Henissey Jabol shared her skills in make-up.</span></p><p><span >The talent presentation of every grade level&rsquo;s emblems uncovered and featured different interesting gifts and talents of the Urians. This event has become a staple of University Days, and the institution intends to continue the tradition in the following years.</span></p>",
    "id": 2,
    "title": "Year Emblems Stand Out, Showcase Talents to Urians",
    "url": "https://cdn.discordapp.com/attachments/897553246787342406/953638245500071947/unknown.png"
  },
  {
    "authors": "Haseena Alexa E. Montante",
    "content": "<p><span >To be isolated is not the way we were supposed to live our lives, especially when faced with difficulties. Being out independently as a teenager without fear of contracting a virus may benefit one's mental health, including one's sense of identity, self-esteem, and sense of belonging. Our days are not meant to be spent locked in our homes, growing longer and deeper with each passing moment as it adds to the weight of our sighs. As students, we are expected to connect with the world around us to pick up a few experiences and understanding. However, with the pandemic seething, we are unable to do much but wait and learn from our screens. All we can do is pray for the sparking hope to become a reality.</span></p><p><strong><em>Tayong</em></strong><em><span > lahat sa mundo ay napilitang umayon sa distant learning. Makalipas ang ilang buwan ay bumalik na ito sa face-to-face class, ngunit </span></em><strong><em>sila</em></strong><em><span > lamang (foreign countries). Habang </span></em><strong><em>kami</em></strong><em><span >, mga Pilipino, ay napipilitan paring maki-ayon sa distant learning.&nbsp;</span></em></p><p><span >In December 2019, the COVID-19 pandemic began. Many facets of society were significantly affected, and among those is the education sector. Gradually, the situation worsened, which pushed academic institutions to go on distant learning due to the global lockdown. As a result of these new adjustments, educational faculty, staff, and students are caught in a tight situation with limited options.&nbsp;</span></p><p><span >Fortunately for other countries, government leaders acted swiftly, ensuring that people took further health procedures at a higher level. As a product of their well-thought-out and prompt responses, students were able to physically return to their classrooms in just a few months. As for the Philippines, we have to endure another year of distant teaching and learning.&nbsp;</span></p><p><em><span >Tayo, hindi sila</span></em><span >. Or if speaking globally: </span><em><span >kami, hindi tayo</span></em><span >.&nbsp;</span></p><p><span >The Philippines began restricted face-to-face sessions on the 15th of November 2021, after nearly two years of school shut down due to the COVID-19 outbreak. President Rodrigo Duterte has given a go for a two-month pilot program in 100 public schools. Thirty private schools would also begin restricted in-person sessions one week later, on the 22nd of November. The news sparked hope for students in the Philippines&mdash;students who have had their mental health decline due to the pressure and stress that distant learning has brought. Most can agree that students may find healthy education within the company of teachers and classmates. However, despite the number of students who wish to study in person, others believe that our country is not ready for this educational experience.&nbsp;</span></p><p><span >School closures have had a wide range of adverse effects for students, including academic difficulties, mental distress, increased chance of dropping out, and child labor. To put it simply, we can benefit from a more personal, face-to-face education. But it is hard to believe that this mode of learning can take place again when our government appears to remain in disarray. We are falling further and further into the rabbit hole of falling behind, and now it is worse than ever. That is why it is somewhat nerve-wracking that we are reeling in a gamble for the sake of our education.</span></p><p><span >Nevertheless, even if the improvement is slow, progress is progress. However, the greatest concern is that while government officials promised that no student would be left behind, the Philippines itself as a nation seems to have been left behind.&nbsp;</span></p><p><em><span >Naghahanap </span></em><strong><em>tayo</em></strong><em><span > ng mga makakapagpabuti; mabilis </span></em><strong><em>silang</em></strong><em><span > umuusad, habang </span></em><strong><em>kami'y</em></strong><em><span > paparating lamang.</span></em></p><p><span >How long until the sparking hope turns into reality?</span></p>",
    "id": 1,
    "title": "Kami, Tayo, Sila: Education in the Face of a Pandemic",
    "url": "https://cdn.discordapp.com/attachments/897553246787342406/953636422617825290/unknown.png"
  },
  {
    "authors": "Erika Bianca Sanchez",
    "content": "<p><em><span >\"If you are one of the lucky ones who have survived the darkness, just remember, never look back,\"</span></em></p><p><span >&hellip;is what many would say is an act of consolation and a push to keep going. This, however, does not fit the conversation of Philippine politics at all, where the haunting past has come back knocking on everyone's door once more. Said knock is one that should be ringing in everyone's ears as a truth that cannot and should not be ignored.</span></p><p><span >&nbsp;It is often circulated that today's youth are uninterested in political events and are too wrapped up in their self-interests to pay any mind to the business of politics. Yet, commonplace phrases like \"the youth are the future\" or \"the youth is the hope of our nation\" are looking to ring true, especially in today's Philippine society. Scrolling through social media will give you a sense of how young people have turned digital spaces into a microcosm of what the Philippines should and should not be. With the 2022 elections right around the corner, the youth vote &mdash; both an idea and advocacy &mdash; has become not just a trend but an absolute necessity again.&nbsp;</span></p><p><span >Anything that impedes the right to vote impedes democracy itself. Political participation is a constitutionally-recognized right, but some choose to be non-participative anyway. It is not enough to have the right (to vote); it is just as important to be responsible enough to make full use of it to prevent another reign of ruthless tyranny and senseless violence.</span></p><p><span >&nbsp;</span> <span >As political dynasties and oligarchs continue to prevail, the remedy might not only be legislative but cultural-structural. When the core of power is rent-seeking behavior and political patronage, prohibiting political dynasties will not lead to the oligarchy's demise. While dynasties enable oligarchy, it is deeply rooted in structural inequalities in wealth and power and the weaknesses of our political institutions, such as the political party system.</span></p><p><span >The real enemy here is the concentration of power. Political dynasties and oligarchy are just symptoms and structural manifestations of it. The concentration of power in the political and economic elites is possible because the people have renounced their role as sovereigns and their responsibility to participate in politics as empowered, rational, active, and well-informed citizens. The antidote to this should not stop at enacting a law prohibiting political dynasties. The solution is political literacy and education, which will enable people to become active citizens and reclaim their sovereign power at all levels.</span></p><p><span >It is a fact of life that we live in a political landscape marked by extreme inequality. Some would argue that the strength of its institutions determines a good democratic government. Although partially true, the essence of democracy is actually the citizens. The quality of government lies on the quality of the governed&mdash;those governed must be politically literate enough to understand the significance of living in a democracy. Citizens, especially the youth, will have to learn the virtue of criticism and the value of dissent.</span></p><p>&nbsp;</p><p><span >Young people are the future that will support all the generations before them. However, power is constantly being withheld from the youth, limiting and binding any form of political movement. Interpreting low voter turnout as evidence of apathy ignores the structural, organizational, and familial obstacles many young people face. Of course, you could turn your back on all things political in the hopes somebody else will stand up for your opinion. Yet, the moment young people turn their back on politics is the exact moment citizens lose power over their lives.&nbsp;</span></p><p><span >Politics is giving the people in power all the capacities they need to take over lives and transform them into whatever they wish. The youth do not just benefit; they are part of the conversation. The moment people stop caring is the moment they give up control. The youth should care about politics because they concern them more than anyone. Young people have the world in their hands&ndash;take your eyes off politics, and you&rsquo;re gone. Just like that.</span></p><p><span >At least 67.5 million Filipinos will be eligible to cast their ballots in the coming elections, a number which the Commission on Elections (COMELEC) stated is proof that Filipinos are eager to vote even with the threat of an ongoing pandemic. With 32.7 million between the ages of 18 and 30, at least 5.4 million are voting for the first time. Beyond registered voters, these figures show that the youth have the right, the skills, and definitely the numbers to make a difference.&nbsp;</span></p><p><span >The old mantra to \"never discuss religion or politics\" was a recognition that political differences can create awkward social situations. Thus, many avoid the conversation just to preserve the bonds and close ties that are on the line when politics are at stake. People fail to realize that you are precisely who you vote for; to give your support to any political candidate or institution, whether out of affinity, blood, or loyalty, is between you and your conscience&mdash;it's a reflection of your beliefs that forms you. Being politically literate is more than just knowing the institutions and the people behind them. It's a call for values, and the earlier you accept and grasp that fact, the earlier you embody political literacy.</span></p><p><span >Being politically literate means knowing that it is not and never will be enough to have heard your parent's viewpoints on something and adopt them as your own. That it's not just about dropping opinions but having formed informed judgment to go with it as well. That it is not enough to go through your social media timelines and read only the shared posts of people that have grown up in similar ideals and places as you. While social media has its advantages, it makes it more difficult to have an in-depth, respectful discussion of issues often due to anonymity. The character limits of a tweet or post may prevent users from conveying the full complexity of their views&mdash;an easy invite to misinterpretation. There are scholarly works worth reading besides the TikTok videos and Facebook posts, too, you know.</span></p><p><span >Being politically literate means knowing people in power aren't usually that clear-headed; they don't make a substantial distinction between what's politically convenient to say and what they really believe. It's pretty clear that much of what a number of politicians say is in self-conscious lousy faith; they say what is politically convenient, brush aside facts that don't fit their agendas, and make claims they have to know are false.</span></p><p><span >Political literacy is the only way to diminish the power of oligarchs and render dynasties irrelevant. It is the only way to prevent the past from coming back and continue a regime of grand corruption and abuses. The only way to prevent this concentration of power in a few is for us, the many, to take it back&mdash;the only way to live in a better Philippine era.</span></p><p><span >The general divide in politics is often depicted as purely cultural&mdash;as if one's politics were solely mediated by aesthetics, such as whether one prefers shooting guns or drinking wine. This is a great detriment to civil discourse. Seeing politics as an aesthetic transforms what should be a quantitative debate&mdash;with statistics and numbers about taxation and public policy and questions about who benefits more or less from policy changes&mdash;into a rhetorical debate about values. Paul Krugman, an economist, professor, and New York Times columnist, once wrote that the malign influence of these people is \"propping up zombie ideas &mdash; ideas that should have been killed by contrary evidence, but instead keep shambling along, eating people's brains.\"</span></p><p><span >In a country where zombies are lurking in politics and among the masses, it's all about defending your life, as well as protecting those around you even if they remain strangers&mdash;no matter how far you are in life, we will all go alive from here.</span></p>",
    "id": 2,
    "title": "If You Vote Wrong, ALL OF US ARE DEAD",
    "url": "https://cdn.discordapp.com/attachments/897553246787342406/953638546063917086/unknown.png"
  }
]
