[
  {
    "authors": "Ianne Gencianeo",
    "content": "<p><span >Father Saturnino Urios University celebrated its 120th foundation day anniversary through virtual or online platforms. Year emblems are back at it again as each gained the limelight and featured their talents in the FSUU page last September 23, 2021.</span></p><p><span >In this year&rsquo;s University Days, each emblem was given the opportunity to highlight their talents and represent their respective grade levels&mdash;an event that allowed the students to know their fellow Urians better.&nbsp;</span></p><p><span >The Grade 7 Green Python&rsquo;s Emmanuel Corvera shared his talent in art and making music, while Uaine Sarsaba, shared her groove and talent in dancing while mirroring how a snake slithers.</span></p><p><span >Grade 8 Yellow Phoenix's Jai Uchida, a young and aspiring athlete,&nbsp; showed his excellent skills in Taekwondo while giving an awe-inspiring rendition of his athletic kicks and forms in the Korean martial art.&nbsp; On the other hand, his partner April Tapon presented a time lapse of herself drawing a building with her pencil strokes.</span></p><p><span >Moreover, the third-year representative, Khadd Lansang danced in tune of the trending K-pop songs Butter and Dynamite while Aaliyah Orcollo represented the Red Raptors with her own song rendition.</span></p><p><span >Furthermore, Blue Eagle&rsquo;s Kennevic Elumbaring shared a recorded video of himself making a realistic drawing of an eagle while his emblem partner, Rafaela Andaya performed her dance number.</span></p><p><span >Meanwhile, Grade 11 Greyhounds&rsquo; Miguel Catubag played his way through the chords as he covered a song with his electric guitar while his counterpart, Janine Suazo, presented a dance.</span></p><p><span >Ishin Nonan of the Galactic Wolves featured his drumming skills while covering a song while Henissey Jabol shared her skills in make-up.</span></p><p><span >The talent presentation of every grade level&rsquo;s emblems uncovered and featured different interesting gifts and talents of the Urians. This event has become a staple of University Days, and the institution intends to continue the tradition in the following years.</span></p>",
    "id": 2,
    "title": "Year Emblems Stand Out, Showcase Talents to Urians",
    "url": "https://cdn.discordapp.com/attachments/897553246787342406/953638245500071947/unknown.png"
  },
  {
    "authors": "Haseena Alexa E. Montante",
    "content": "<p><span >To be isolated is not the way we were supposed to live our lives, especially when faced with difficulties. Being out independently as a teenager without fear of contracting a virus may benefit one's mental health, including one's sense of identity, self-esteem, and sense of belonging. Our days are not meant to be spent locked in our homes, growing longer and deeper with each passing moment as it adds to the weight of our sighs. As students, we are expected to connect with the world around us to pick up a few experiences and understanding. However, with the pandemic seething, we are unable to do much but wait and learn from our screens. All we can do is pray for the sparking hope to become a reality.</span></p><p><strong><em>Tayong</em></strong><em><span > lahat sa mundo ay napilitang umayon sa distant learning. Makalipas ang ilang buwan ay bumalik na ito sa face-to-face class, ngunit </span></em><strong><em>sila</em></strong><em><span > lamang (foreign countries). Habang </span></em><strong><em>kami</em></strong><em><span >, mga Pilipino, ay napipilitan paring maki-ayon sa distant learning.&nbsp;</span></em></p><p><span >In December 2019, the COVID-19 pandemic began. Many facets of society were significantly affected, and among those is the education sector. Gradually, the situation worsened, which pushed academic institutions to go on distant learning due to the global lockdown. As a result of these new adjustments, educational faculty, staff, and students are caught in a tight situation with limited options.&nbsp;</span></p><p><span >Fortunately for other countries, government leaders acted swiftly, ensuring that people took further health procedures at a higher level. As a product of their well-thought-out and prompt responses, students were able to physically return to their classrooms in just a few months. As for the Philippines, we have to endure another year of distant teaching and learning.&nbsp;</span></p><p><em><span >Tayo, hindi sila</span></em><span >. Or if speaking globally: </span><em><span >kami, hindi tayo</span></em><span >.&nbsp;</span></p><p><span >The Philippines began restricted face-to-face sessions on the 15th of November 2021, after nearly two years of school shut down due to the COVID-19 outbreak. President Rodrigo Duterte has given a go for a two-month pilot program in 100 public schools. Thirty private schools would also begin restricted in-person sessions one week later, on the 22nd of November. The news sparked hope for students in the Philippines&mdash;students who have had their mental health decline due to the pressure and stress that distant learning has brought. Most can agree that students may find healthy education within the company of teachers and classmates. However, despite the number of students who wish to study in person, others believe that our country is not ready for this educational experience.&nbsp;</span></p><p><span >School closures have had a wide range of adverse effects for students, including academic difficulties, mental distress, increased chance of dropping out, and child labor. To put it simply, we can benefit from a more personal, face-to-face education. But it is hard to believe that this mode of learning can take place again when our government appears to remain in disarray. We are falling further and further into the rabbit hole of falling behind, and now it is worse than ever. That is why it is somewhat nerve-wracking that we are reeling in a gamble for the sake of our education.</span></p><p><span >Nevertheless, even if the improvement is slow, progress is progress. However, the greatest concern is that while government officials promised that no student would be left behind, the Philippines itself as a nation seems to have been left behind.&nbsp;</span></p><p><em><span >Naghahanap </span></em><strong><em>tayo</em></strong><em><span > ng mga makakapagpabuti; mabilis </span></em><strong><em>silang</em></strong><em><span > umuusad, habang </span></em><strong><em>kami'y</em></strong><em><span > paparating lamang.</span></em></p><p><span >How long until the sparking hope turns into reality?</span></p>",
    "id": 1,
    "title": "Kami, Tayo, Sila: Education in the Face of a Pandemic",
    "url": "https://cdn.discordapp.com/attachments/897553246787342406/953636422617825290/unknown.png"
  },
  {
    "authors": "Dennis Castilla",
    "content": "<p><em><span >&ldquo;Naa ra man na saimong huna-huna uy&rdquo; (It&rsquo;s all in your mind.)&nbsp;</span></em></p><p><em><span >&ldquo;Sus, mas lala pa gani ako gi bati pero wala man lagi ko nag-breakdown&rdquo; (My situation is much worse than yours but I didn&rsquo;t even break down.)&nbsp;</span></em></p><p><span >These are just among the statements that I hear whenever I get caught having a breakdown and experiencing trauma, which started when the coronavirus broke out and has persisted through the present time. It is safe to assume that a lot of people have also received similar phrases posed to be \"comforting\" and \"consoling.\" Still, in reality, it is not helping at all as it masks an invalidation of one's feelings.&nbsp;</span></p><p><span >Due to the deadly pandemic that sparked in early 2020, students have shifted to new modes of learning to better adapt to the situation&mdash;which contributed substantially to the mental health state of many. As I made my way through online learning, little did I know that I was about to face enormous challenges and trials that took a toll on my wellbeing. Inundated with schoolwork, projects, backlogs, it would even come to the point where I encountered burnouts, breakdowns, sleepless nights. It wasn't easy to comprehend what I was feeling anymore.&nbsp;</span></p><p><span >But the breakdowns and challenges that we may experience are not limited to our studies or schooling only; it also covers life in general. But the majority of us students experience it in our classes. As I have encountered, there are people that somewhat help you, but in reality, they are not helping you at all. Throwing statements like, \"It's okay, there's nothing to worry about, my situation is much worse than yours\" or \"Man up, men shouldn't be affected by such a small thing.\"&nbsp;</span></p><p><span >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;On the other hand, a college student who is a close relative went through a rough time. She has deteriorating mental health and was diagnosed with severe anxiety and depression by her psychiatrist.&nbsp;</span></p><p><span >A student aspiring to become a doctor one day, this relative of mine is a very jolly, goal-oriented, and optimistic person. And it was least to my expectation that she would be in such a situation. And I was there, witnessing how she suffered and was in a grim situation. I witnessed the gloomy and doleful face that she projected to us. The cause? Recurring trauma, academic problems, pressure, dilemma, and anxiety.&nbsp;</span></p><p><span >&nbsp;Her current state was very critical. Attempting to console her by using statements like, it would be okay and what you're experiencing is just in your mind, would be downright absurd and insignificant. She exhibited self-harm and suicidal acts and repeatedly said that she wished she would be gone in this world instantly.&nbsp;</span></p><p><span >&nbsp;It was very sad and disheartening. It was also as if the dim situation infected me by thinking about her and talking to her. Moreover, another close relative of mine, a close relative of mine, also a student, who accompanies her day-to-day living, and now takes care of her, was slowly being affected. She developed depression and breakdowns that significantly affected her studies and well-being.&nbsp;</span></p><p><span >&nbsp;Thankfully, with constant communication and support coming from the family and with the help of the health experts (psychiatrist and psychologist), their condition slightly became better. Although, not simultaneously, we can see that they are still right on track in the process of improving and healing.&nbsp;</span></p><p><span >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;These two relatives of mine are indeed only the tip of the iceberg for how many individuals are experiencing mental health issues. They weren&rsquo;t seeking any social attention, but they needed help. Their emotions and mental breakdowns did not merely and capriciously pop up in their minds. Still, they were experiencing mental and emotional issues that disrupted and affected their well-being and their ability to function smoothly in their daily lives.&nbsp;</span></p><p><span >&nbsp;&nbsp;&nbsp;&nbsp;</span></p><p><span >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;One reason that may be attributed to this is that people tend to forget the actual definition of mental health. According to the World Health Organization (WHO), mental health is the cognitive and emotional well-being; it is the foundation for individuals' well-being and effective functioning. It is the state of balance, both within and with the environment.&nbsp;</span></p><p><span >Contrary to this definition given by the World Health Organization (WHO), people are more likely to define mental health as the mere absence of mental illness. If you have worsening mental health, you are mentally ill. They consider it unimportant and label those who have any forms of mental health issues to be overreacting, emphasizing and further carving the mental health stigma in our country. The problem with this is that it makes people suffering from mental health vulnerable to discrimination. It also poses a barrier to them in seeking help and support.&nbsp;</span></p><p><span >Mental health issues often aggravate suicide cases if not appropriately addressed and immediately. According to SPARK (Samahan ng Progresibong Kabataan), at least 17 suicide incidents among students were recorded a few months after the pandemic started. The Philippine Statistics Authority also presented that the suicide rate in the Philippines increased by 26% last 2020.&nbsp;</span></p><p><span >So let us reinforce the importance of mental health. As much as we want to be physically fit and healthy, we must also go for our mental health. If you have mental and emotional issues, acknowledge them, don't bottle it up; it's okay not to be okay. Invest in mental health support, do not be afraid to seek help because your health matters, your mental health matters, and most importantly, you matter.</span></p>",
    "id": 2,
    "title": "You Matter",
    "url": "https://cdn.discordapp.com/attachments/897553246787342406/953682288246390844/Group_59.png"
  }
]
